Revit 2027 API
LightGroupManager.GetGroups Method
 Get the set of contained LightGroup objects The set of LightGroup objects
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<LightGroup> GetGroups()
Public Function GetGroups As IList(Of LightGroup)
public:
IList<LightGroup^>^ GetGroups()
member GetGroups : unit -> IList<LightGroup>
Return Value
IList<LightGroup>
See Also
Reference
LightGroupManager Class
Autodesk.Revit.DB.Lighting Namespace